ci4/app/Controllers/Artikel.php

    public function index()
    {
        $title = 'Daftar Artikel';
        $model = new ArtikelModel();
        $artikel = $model->findAll();
---
SELECT *
FROM `artikel`

    public function view($slug)
    {
        $model = new ArtikelModel();
        $artikel = $model->where([
            'slug' => $slug
        ])->first();
---
SELECT *
FROM `artikel`
WHERE `slug` = 'Artikel-Pertama'
 LIMIT 1

    public function admin_index()
    {
        $title = 'Daftar Artikel';
        $q = $this->request->getVar('q') ?? '';
        $model = new ArtikelModel();

        // Cek apakah ada pencarian
        if (!empty($q)) {
            $model->like('judul', $q)->orLike('isi', $q);
        }

        $data = [
            'title'   => $title,
            'q'       => $q,
            'artikel' => $model->paginate(10),
---
SELECT *
FROM `artikel`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `artikel`

    public function edit($id)
    {
        $artikel = new ArtikelModel();

        // validasi data.
        $validation =  \Config\Services::validation();
        $validation->setRules(['judul' => 'required']);
        $isDataValid = $validation->withRequest($this->request)->run();

        if ($isDataValid)
        {
            $artikel->update($id, [
                'judul' => $this->request->getPost('judul'),
                'isi' => $this->request->getPost('isi'),
            ]);
            return redirect('admin/artikel');
        }

        // ambil data lama
        $data = $artikel->where('id', $id)->first();
---
SELECT *
FROM `artikel`
WHERE `id` = '14'
 LIMIT 1